zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_ll_mdma.c
#define IS_LL_MDMA_PACKMODE(__VALUE__)                    (((__VALUE__) == LL_MDMA_PACK_DISABLE) || \
                                                           ((__VALUE__) == LL_MDMA_PACK_ENABLE))

#define IS_LL_MDMA_BUFFER_XFERLENGTH(__VALUE__)           ((__VALUE__)  <= 0x0000007FU)

#define IS_LL_MDMA_DESTBURST(__VALUE__)                   (((__VALUE__) == LL_MDMA_DEST_BURST_SINGLE) || \
                                                           ((__VALUE__) == LL_MDMA_DEST_BURST_2BEATS) || \
                                                           ((__VALUE__) == LL_MDMA_DEST_BURST_4BEATS) || \
                                                           ((__VALUE__) == LL_MDMA_DEST_BURST_8BEATS) || \
                                                           ((__VALUE__) == LL_MDMA_DEST_BURST_16BEATS)|| \
                                                           ((__VALUE__) == LL_MDMA_DEST_BURST_32BEATS)|| \
                                                           ((__VALUE__) == LL_MDMA_DEST_BURST_64BEATS)|| \
                                                           ((__VALUE__) == LL_MDMA_DEST_BURST_128BEATS))

#define IS_LL_MDMA_SRCTBURST(__VALUE__)                   (((__VALUE__) == LL_MDMA_SRC_BURST_SINGLE) || \
                                                           ((__VALUE__) == LL_MDMA_SRC_BURST_2BEATS) || \
                                                           ((__VALUE__) == LL_MDMA_SRC_BURST_4BEATS) || \
                                                           ((__VALUE__) == LL_MDMA_SRC_BURST_8BEATS) || \
                                                           ((__VALUE__) == LL_MDMA_SRC_BURST_16BEATS)|| \
                                                           ((__VALUE__) == LL_MDMA_SRC_BURST_32BEATS)|| \
                                                           ((__VALUE__) == LL_MDMA_SRC_BURST_64BEATS)|| \
                                                           ((__VALUE__) == LL_MDMA_SRC_BURST_128BEATS))

#define IS_LL_MDMA_DESTINCSIZE(__VALUE__)                 (((__VALUE__) == LL_MDMA_DEST_INC_OFFSET_BYTE) || \
                                                           ((__VALUE__) == LL_MDMA_DEST_INC_OFFSET_HALFWORD) || \
                                                           ((__VALUE__) == LL_MDMA_DEST_INC_OFFSET_WORD) || \
                                                           ((__VALUE__) == LL_MDMA_DEST_INC_OFFSET_DOUBLEWORD))

#define IS_LL_MDMA_SRCINCSIZE(__VALUE__)                  (((__VALUE__) == LL_MDMA_SRC_INC_OFFSET_BYTE)     || \
                                                           ((__VALUE__) == LL_MDMA_SRC_INC_OFFSET_HALFWORD) || \
                                                           ((__VALUE__) == LL_MDMA_SRC_INC_OFFSET_WORD)     || \
                                                           ((__VALUE__) == LL_MDMA_SRC_INC_OFFSET_DOUBLEWORD))

#define IS_LL_MDMA_DESTDATASIZE(__VALUE__)                (((__VALUE__) == LL_MDMA_DEST_DATA_SIZE_BYTE) || \
                                                           ((__VALUE__) == LL_MDMA_DEST_DATA_SIZE_HALFWORD) || \
                                                           ((__VALUE__) == LL_MDMA_DEST_DATA_SIZE_WORD) || \
                                                           ((__VALUE__) == LL_MDMA_DEST_DATA_SIZE_DOUBLEWORD))

#define IS_LL_MDMA_SRCDATASIZE(__VALUE__)                 (((__VALUE__) == LL_MDMA_SRC_DATA_SIZE_BYTE) || \
                                                           ((__VALUE__) == LL_MDMA_SRC_DATA_SIZE_HALFWORD) || \
                                                           ((__VALUE__) == LL_MDMA_SRC_DATA_SIZE_WORD) || \
                                                           ((__VALUE__) == LL_MDMA_SRC_DATA_SIZE_DOUBLEWORD))

#define IS_LL_MDMA_DESTINCMODE(__VALUE__)                 (((__VALUE__) == LL_MDMA_DEST_FIXED) || \
                                                           ((__VALUE__) == LL_MDMA_DEST_INCREMENT) || \
                                                           ((__VALUE__) == LL_MDMA_DEST_DECREMENT))

#define IS_LL_MDMA_SRCINCMODE(__VALUE__)                  (((__VALUE__) == LL_MDMA_SRC_FIXED) || \
                                                           ((__VALUE__) == LL_MDMA_SRC_INCREMENT) || \
                                                           ((__VALUE__) == LL_MDMA_SRC_DECREMENT))

#define IS_LL_MDMA_BLKRPT_DEST_ADDRUPDATEMODE(__VALUE__)  (((__VALUE__) == LL_MDMA_BLK_RPT_DEST_ADDR_INCREMENT) || \
                                                           ((__VALUE__) == LL_MDMA_BLK_RPT_DEST_ADDR_DECREMENT))


#define IS_LL_MDMA_BLKRPT_SRC_ADDRUPDATEMODE(__VALUE__)   (((__VALUE__) == LL_MDMA_BLK_RPT_SRC_ADDR_INCREMENT) || \
                                                           ((__VALUE__) == LL_MDMA_BLK_RPT_SRC_ADDR_DECREMENT))

#define IS_LL_MDMA_BLKRPT_DEST_ADDRUPDATEVAL(__VALUE__)   ((__VALUE__)  <= 0x0000FFFFU)

#define IS_LL_MDMA_BLKRPT_SRC_ADDRUPDATEVAL(__VALUE__)    ((__VALUE__)  <= 0x0000FFFFU)

#define IS_LL_MDMA_DEST_BUS(__VALUE__)                    (((__VALUE__) == LL_MDMA_DEST_BUS_SYSTEM_AXI) || \
                                                           ((__VALUE__) == LL_MDMA_DEST_BUS_AHB_TCM))

#define IS_LL_MDMA_SRC_BUS(__VALUE__)                     (((__VALUE__) == LL_MDMA_SRC_BUS_SYSTEM_AXI) || \
                                                           ((__VALUE__) == LL_MDMA_SRC_BUS_AHB_TCM))

#define IS_LL_MDMA_HWTRIGGER(__VALUE__)                   (((__VALUE__) == LL_MDMA_REQ_DMA1_STREAM0_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA1_STREAM1_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA1_STREAM2_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA1_STREAM3_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA1_STREAM4_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA1_STREAM5_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA1_STREAM6_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA1_STREAM7_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA2_STREAM0_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA2_STREAM1_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA2_STREAM2_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA2_STREAM3_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA2_STREAM4_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA2_STREAM5_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA2_STREAM6_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA2_STREAM7_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA3_STREAM0_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA3_STREAM1_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA3_STREAM2_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA3_STREAM3_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA3_STREAM4_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA3_STREAM5_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA3_STREAM6_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_DMA3_STREAM7_TC)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_FMC_DATA)             || \
                                                           ((__VALUE__) == LL_MDMA_REQ_FMC_ERROR)            || \
                                                           ((__VALUE__) == LL_MDMA_REQ_QUADSPI_FIFO_TH)      || \
                                                           ((__VALUE__) == LL_MDMA_REQ_QUADSPI_TC)           || \
                                                           ((__VALUE__) == LL_MDMA_REQ_CRYP1_IN)             || \
                                                           ((__VALUE__) == LL_MDMA_REQ_CRYP1_OUT)            || \
                                                           ((__VALUE__) == LL_MDMA_REQ_HASH1_IN)             || \
                                                           ((__VALUE__) == LL_MDMA_REQ_SAES_IN)              || \
                                                           ((__VALUE__) == LL_MDMA_REQ_SAES_OUT))

/**
  * @}
  */

